SiriCascudo/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ala@ala"], ["LIMIT", 1]]
---
    def login
        user = User.find_by!(email: params[:email])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def delete
        current_user.destroy!

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$/gNdViTsrB.IOYLKmhvWLeZuapzlw5R.MsRjwvVPhd00keIWlzxVi"], ["updated_at", "2021-11-21 23:45:13.065209"], ["id", 5]]
---
    def update
        current_user.update!(update_user_params)

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2021-11-23 01:20:25.064436"], ["id", 3]]
---
    def register
        user = User.create(create_user_params)
        user.save!

UPDATE "users" SET "updated_at" = $1, "authentication_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-11-22 17:31:15.905466"], ["authentication_token", "SSwSx8qg6uxQ464QrMfA"], ["id", 6]]
---
    def logout
        current_user.update! authentication_token: nil