SiriCascudo/app/controllers/users_controller.rb

    def register
        user = User.create(create_user_params)
        user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"