SiriCascudo/app/controllers/api/v1/categories_controller.rb

    def show
        category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]