SiriCascudo/app/controllers/api/v1/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        if current_user
            favorites = Favorite.where(user_id: current_user.id)
            favoriteMeals = []
            for fav in favorites do
                favoriteMeals.push( Meal.find(fav.meal_id) )

INSERT INTO "favorites" ("user_id", "meal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["meal_id", 1], ["created_at", "2021-11-27 19:25:11.568851"], ["updated_at", "2021-11-27 19:25:11.568851"]]
INSERT INTO "favorites" ("user_id", "meal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["meal_id", 1], ["created_at", "2021-11-27 18:24:07.737773"], ["updated_at", "2021-11-27 18:24:07.737773"]]
---
    def create
        if current_user
            favorite = favorite_params
            favorite[:user_id] = current_user.id
            favorite = Favorite.create(favorite)
            favorite.save!