SiriCascudo/app/controllers/api/v1/meals_controller.rb

SELECT "meals".* FROM "meals"
---
    def index
        meals = Meal.all

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        meal = Meal.find(params[:id])

INSERT INTO "meals" ("name", "description", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "meals" ("name", "description", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "a"], ["description", "a"], ["price", 10.1], ["category_id", 1], ["created_at", "2021-11-23 17:27:39.564974"], ["updated_at", "2021-11-23 17:27:39.564974"]]
---
    def create
        meal = Meal.create(meal_params)
        meal.save!

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "meals" SET "description" = $1, "updated_at" = $2 WHERE "meals"."id" = $3  [["description", "Um verdadeiro clássico"], ["updated_at", "2021-11-20 15:04:11.137834"], ["id", 1]]
---
    def update
        meal = Meal.find(params[:id])
        meal.update!(meal_params)

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 2]]
---
    def delete
        meal = Meal.find(params[:id])
        meal.destroy!